Конфигурация/src/Documents/УслугаСортировки/УслугаСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УслугаСортировки</name>
  <registerRecords>AccumulationRegister.УслугиСортировки</registerRecords>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Дата_Убытие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время_Убытие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГрузовогоМеста</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЕдиницыОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтпСклМс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата_Прибытие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время_Прибытие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТипаОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяУбытие</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяПрибытие</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипГрузовогоМеста</name>
      <type>
        <types>EnumRef.ТипыГрузовыхМест</types>
      </type>
    </attributes>
    <attributes>
      <name>СреднедневноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/ДанныеПроизводственногоКалендаря/ДанныеПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеПроизводственногоКалендаря</name>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/InformationRegisters/ТарифыХранения/ТарифыХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыХранения</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Конфигурация/src/InformationRegisters/ТарифыОбработки/ТарифыОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыОбработки</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипГрузовогоМеста</name>
    <type>
      <types>EnumRef.ТипыГрузовыхМест</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифХаба</name>
    <type>
      <types>CatalogRef.ТарифыХабов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/AccumulationRegisters/УслугиСортировки/УслугиСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УслугиСортировки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаХранение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОбработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоПраздничныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифОбработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТарифХранение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерГрузовогоМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Enums/ВидыДнейПроизводственногоКалендаря/ВидыДнейПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДнейПроизводственногоКалендаря</name>
  <enumValues>
    <name>Рабочий</name>
  </enumValues>
  <enumValues>
    <name>Выходной</name>
  </enumValues>
  <enumValues>
    <name>Праздничный</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Enums/ТипыГрузовыхМест/ТипыГрузовыхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыГрузовыхМест</name>
  <enumValues>
    <name>Хаб</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>КГТ</name>
  </enumValues>
  <enumValues>
    <name>МГТ</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/УслугаСортировки/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УслугаСортировкиУслуги.НомерГрузовогоМеста КАК НомерГрузовогоМеста,
	|	УслугаСортировкиУслуги.ЗаказКлиента КАК ЗаказКлиента,
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) КАК ТарифОбработка,
	|	ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) КАК ТарифХранение,
	|	КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) КАК КоличествоПраздничныеДни,
	|	ВЫБОР
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы < 24
	|			ТОГДА 0
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы <= 36
	|			ТОГДА ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф)
	|		ИНАЧЕ ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) * 2 *
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыХранения.Тариф,
	|			ТарифыХраненияСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня))
	|	КОНЕЦ КАК СуммаХранение,
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) * 2 *
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыОбработки.Тариф,
	|		ТарифыОбработкиСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня)) КАК СуммаОбработка,
	|	УслугаСортировкиУслуги.Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы < 24
	|			ТОГДА 0
	|		КОГДА УслугаСортировкиУслуги.КоличествоЧасы <= 36
	|			ТОГДА ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф)
	|		ИНАЧЕ ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф) * 2 *
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыХранения.Тариф,
	|			ТарифыХраненияСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|			КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня))
	|	КОНЕЦ + ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф) * 2 *
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня) + ЕСТЬNULL(ТарифыОбработки.Тариф,
	|		ТарифыОбработкиСрезПоследних.Тариф) * (УслугаСортировкиУслуги.КоличествоДни -
	|		КОЛИЧЕСТВО(ДанныеПроизводственногоКалендаря.ВидДня)) КАК Сумма,
	|	УслугаСортировкиУслуги.Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УслугаСортировки.Услуги КАК УслугаСортировкиУслуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ПО ДанныеПроизводственногоКалендаря.Дата МЕЖДУ НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие,
	|			ДЕНЬ) И УслугаСортировкиУслуги.ДатаВремяУбытие
	|		И НЕ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыХранения КАК ТарифыХранения
	|		ПО НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие, МЕСЯЦ) = ТарифыХранения.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыОбработки КАК ТарифыОбработки
	|		ПО НАЧАЛОПЕРИОДА(УслугаСортировкиУслуги.ДатаВремяПрибытие, МЕСЯЦ) = ТарифыОбработки.Период
	|		И УслугаСортировкиУслуги.ТипГрузовогоМеста = ТарифыОбработки.ТипГрузовогоМеста
	|		И ВЫБОР
	|			КОГДА УслугаСортировкиУслуги.ТипГрузовогоМеста = ЗНАЧЕНИЕ(Перечисление.ТипыГрузовыхМест.Хаб)
	|				ТОГДА УслугаСортировкиУслуги.СреднедневноеКоличество > ТарифыОбработки.ТарифХаба.От
	|				И УслугаСортировкиУслуги.СреднедневноеКоличество <= ТарифыОбработки.ТарифХаба.До
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыХранения.СрезПоследних КАК ТарифыХраненияСрезПоследних
	|		ПО ИСТИНА
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыОбработки.СрезПоследних КАК ТарифыОбработкиСрезПоследних
	|		ПО УслугаСортировкиУслуги.ТипГрузовогоМеста = ТарифыОбработкиСрезПоследних.ТипГрузовогоМеста
	|		И ВЫБОР
	|			КОГДА УслугаСортировкиУслуги.ТипГрузовогоМеста = ЗНАЧЕНИЕ(Перечисление.ТипыГрузовыхМест.Хаб)
	|				ТОГДА УслугаСортировкиУслуги.СреднедневноеКоличество > ТарифыОбработкиСрезПоследних.ТарифХаба.От
	|				И УслугаСортировкиУслуги.СреднедневноеКоличество <= ТарифыОбработкиСрезПоследних.ТарифХаба.До
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|ГДЕ
	|	УслугаСортировкиУслуги.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	УслугаСортировкиУслуги.НомерГрузовогоМеста,
	|	УслугаСортировкиУслуги.ЗаказКлиента,
	|	УслугаСортировкиУслуги.КоличествоДни,
	|	УслугаСортировкиУслуги.КоличествоЧасы,
	|	ЕСТЬNULL(ТарифыХранения.Тариф, ТарифыХраненияСрезПоследних.Тариф),
	|	ЕСТЬNULL(ТарифыОбработки.Тариф, ТарифыОбработкиСрезПоследних.Тариф),
	|	ТарифыХранения.Тариф,
	|	ТарифыХраненияСрезПоследних.Тариф,
	|	ТарифыОбработки.Тариф,
	|	ТарифыОбработкиСрезПоследних.Тариф,
	|	УслугаСортировкиУслуги.Ссылка,
	|	УслугаСортировкиУслуги.Ссылка.Дата";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	НаборЗаписей = РегистрыНакопления.УслугиСортировки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти
